podonoghue/T962a_Oven_Controller/Software/SMT_Oven_RTOS/Project_Headers/MK22DX256M5.h
#define ETF_CIDR1_Preamble_MASK                  (0xFU)                                              /*!< ETF_CIDR1.Preamble Mask                 */
#define ETF_CIDR1_Preamble_SHIFT                 (0U)                                                /*!< ETF_CIDR1.Preamble Position             */
#define ETF_CIDR1_Preamble(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETF_CIDR1.Preamble Field                */
#define ETF_CIDR1_ComponentClass_MASK            (0xF0U)                                             /*!< ETF_CIDR1.ComponentClass Mask           */
#define ETF_CIDR1_ComponentClass_SHIFT           (4U)                                                /*!< ETF_CIDR1.ComponentClass Position       */
#define ETF_CIDR1_ComponentClass(x)              (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETF_CIDR1.ComponentClass Field          */
/* ------- CIDR2 Bit Fields                         ------ */
#define ETF_CIDR2_Preamble_MASK                  (0xFFU)                                             /*!< ETF_CIDR2.Preamble Mask                 */
#define ETF_CIDR2_Preamble_SHIFT                 (0U)                                                /*!< ETF_CIDR2.Preamble Position             */
#define ETF_CIDR2_Preamble(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ETF_CIDR2.Preamble Field                */
/* ------- CIDR3 Bit Fields                         ------ */
#define ETF_CIDR3_Preamble_MASK                  (0xFFU)                                             /*!< ETF_CIDR3.Preamble Mask                 */
#define ETF_CIDR3_Preamble_SHIFT                 (0U)                                                /*!< ETF_CIDR3.Preamble Position             */
#define ETF_CIDR3_Preamble(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ETF_CIDR3.Preamble Field                */
/**
 * @} */ /* End group ETF_Register_Masks_GROUP 
 */

/* ETF - Peripheral instance base addresses */
#define ETF_BasePtr                    0xE0043000UL //!< Peripheral base address
#define ETF                            ((ETF_Type *) ETF_BasePtr) //!< Freescale base pointer
#define ETF_BASE_PTR                   (ETF) //!< Freescale style base pointer
/**
 * @} */ /* End group ETF_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup ETM_Peripheral_access_layer_GROUP ETM Peripheral Access Layer
* @brief C Struct for ETM
* @{
*/

/* ================================================================================ */
/* ================           ETM (file:ETM_0)                     ================ */
/* ================================================================================ */

/**
 * @brief Embedded Trace Macrocell
 */
/**
* @addtogroup ETM_structs_GROUP ETM struct
* @brief Struct for ETM
* @{
*/
typedef struct ETM_Type {
   __IO uint32_t  CR;                           /**< 0000: Main Control Register                                        */
   __I  uint32_t  CCR;                          /**< 0004: Configuration Code Register                                  */
   __IO uint32_t  TRIGGER;                      /**< 0008: Trigger Event Register                                       */
        uint8_t   RESERVED_0[4];               
   __IO uint32_t  SR;                           /**< 0010: ETM Status Register                                          */
   __I  uint32_t  SCR;                          /**< 0014: System Configuration Register                                */
        uint8_t   RESERVED_1[8];               
   __IO uint32_t  EEVR;                         /**< 0020: Trace Enable Event Register                                  */
   __IO uint32_t  TECR1;                        /**< 0024: Trace Enable Control 1 Register                              */
   __IO uint32_t  FFLR;                         /**< 0028: FIFOFULL Level Register                                      */
        uint8_t   RESERVED_2[276];             
   __IO uint32_t  CNTRLDVR1;                    /**< 0140: Free-running counter reload value                            */
        uint8_t   RESERVED_3[156];             
   __I  uint32_t  SYNCFR;                       /**< 01E0: Synchronization Frequency Register                           */
   __I  uint32_t  IDR;                          /**< 01E4: ID Register                                                  */
   __I  uint32_t  CCER;                         /**< 01E8: Configuration Code Extension Register                        */
        uint8_t   RESERVED_4[4];               
   __IO uint32_t  TESSEICR;                     /**< 01F0: TraceEnable Start/Stop EmbeddedICE Control Register          */
        uint8_t   RESERVED_5[4];               
   __IO uint32_t  TSEVR;                        /**< 01F8: Timestamp Event Register                                     */
        uint8_t   RESERVED_6[4];               
   __IO uint32_t  TRACEIDR;                     /**< 0200: CoreSight Trace ID Register                                  */
        uint8_t   RESERVED_7[4];               
   __I  uint32_t  IDR2;                         /**< 0208: ETM ID Register 2                                            */
        uint8_t   RESERVED_8[264];             
   __I  uint32_t  PDSR;                         /**< 0314: Device Power-Down Status Register                            */
        uint8_t   RESERVED_9[3016];            
   __I  uint32_t  _ITMISCIN;                    /**< 0EE0: Integration Test Miscelaneous Inputs Register                */
        uint8_t   RESERVED_10[4];              
   __O  uint32_t  _ITTRIGOUT;                   /**< 0EE8: Integration Test Trigger Out Register                        */
        uint8_t   RESERVED_11[4];              
   __I  uint32_t  _ITATBCTR2;                   /**< 0EF0: ETM Integration Test ATB Control 2 Register                  */
        uint8_t   RESERVED_12[4];              
   __O  uint32_t  _ITATBCTR0;                   /**< 0EF8: ETM Integration Test ATB Control 0 Register                  */
        uint8_t   RESERVED_13[4];              
   __IO uint32_t  ITCTRL;                       /**< 0F00: Integration Mode Control Register                            */
        uint8_t   RESERVED_14[156];            
   __IO uint32_t  CLAIMSET;                     /**< 0FA0: Claim Tag Set Register                                       */
   __IO uint32_t  CLAIMCLR;                     /**< 0FA4: Claim Tag Clear Register                                     */
        uint8_t   RESERVED_15[8];              
   __IO uint32_t  LAR;                          /**< 0FB0: Lock Access Register                                         */
   __I  uint32_t  LSR;                          /**< 0FB4: Lock Status Register                                         */
   __I  uint32_t  AUTHSTATUS;                   /**< 0FB8: Authentication Status Register                               */
        uint8_t   RESERVED_16[16];             
   __I  uint32_t  DEVTYPE;                      /**< 0FCC: CoreSight Device Type Register                               */
   __I  uint32_t  PIDR4;                        /**< 0FD0: Peripheral Identification Register 4                         */
   __I  uint32_t  PIDR5;                        /**< 0FD4: Peripheral Identification Register 5                         */
   __I  uint32_t  PIDR6;                        /**< 0FD8: Peripheral Identification Register 6                         */
   __I  uint32_t  PIDR7;                        /**< 0FDC: Peripheral Identification Register 7                         */
   __I  uint32_t  PIDR0;                        /**< 0FE0: Peripheral Identification Register 0                         */
   __I  uint32_t  PIDR1;                        /**< 0FE4: Peripheral Identification Register 1                         */
   __I  uint32_t  PIDR2;                        /**< 0FE8: Peripheral Identification Register 2                         */
   __I  uint32_t  PIDR3;                        /**< 0FEC: Peripheral Identification Register 3                         */
   __I  uint32_t  CIDR0;                        /**< 0FF0: Component Identification Register 0                          */
   __I  uint32_t  CIDR1;                        /**< 0FF4: Component Identification Register 1                          */
   __I  uint32_t  CIDR2;                        /**< 0FF8: Component Identification Register 2                          */
   __I  uint32_t  CIDR3;                        /**< 0FFC: Component Identification Register 3                          */
} ETM_Type;

/**
 * @} */ /* End group ETM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'ETM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

