podonoghue/T962a_Oven_Controller/Software/SMT_Oven_RTOS/Project_Headers/MK22DX256M5.h
/**
* @addtogroup ETM_Register_Masks_GROUP ETM Register Masks
* @brief Register Masks for ETM
* @{
*/
/* ------- CR Bit Fields                            ------ */
#define ETM_CR_ETMPD_MASK                        (0x1U)                                              /*!< ETM_CR.ETMPD Mask                       */
#define ETM_CR_ETMPD_SHIFT                       (0U)                                                /*!< ETM_CR.ETMPD Position                   */
#define ETM_CR_ETMPD(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETM_CR.ETMPD Field                      */
#define ETM_CR_PS_MASK                           (0x70U)                                             /*!< ETM_CR.PS Mask                          */
#define ETM_CR_PS_SHIFT                          (4U)                                                /*!< ETM_CR.PS Position                      */
#define ETM_CR_PS(x)                             (((uint32_t)(((uint32_t)(x))<<4U))&0x70UL)          /*!< ETM_CR.PS Field                         */
#define ETM_CR_SP_MASK                           (0x80U)                                             /*!< ETM_CR.SP Mask                          */
#define ETM_CR_SP_SHIFT                          (7U)                                                /*!< ETM_CR.SP Position                      */
#define ETM_CR_SP(x)                             (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< ETM_CR.SP Field                         */
#define ETM_CR_BO_MASK                           (0x100U)                                            /*!< ETM_CR.BO Mask                          */
#define ETM_CR_BO_SHIFT                          (8U)                                                /*!< ETM_CR.BO Position                      */
#define ETM_CR_BO(x)                             (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< ETM_CR.BO Field                         */
#define ETM_CR_DRC_MASK                          (0x200U)                                            /*!< ETM_CR.DRC Mask                         */
#define ETM_CR_DRC_SHIFT                         (9U)                                                /*!< ETM_CR.DRC Position                     */
#define ETM_CR_DRC(x)                            (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< ETM_CR.DRC Field                        */
#define ETM_CR_ETMP_MASK                         (0x400U)                                            /*!< ETM_CR.ETMP Mask                        */
#define ETM_CR_ETMP_SHIFT                        (10U)                                               /*!< ETM_CR.ETMP Position                    */
#define ETM_CR_ETMP(x)                           (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< ETM_CR.ETMP Field                       */
#define ETM_CR_ETMPS_MASK                        (0x800U)                                            /*!< ETM_CR.ETMPS Mask                       */
#define ETM_CR_ETMPS_SHIFT                       (11U)                                               /*!< ETM_CR.ETMPS Position                   */
#define ETM_CR_ETMPS(x)                          (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< ETM_CR.ETMPS Field                      */
#define ETM_CR_PM2_MASK                          (0x2000U)                                           /*!< ETM_CR.PM2 Mask                         */
#define ETM_CR_PM2_SHIFT                         (13U)                                               /*!< ETM_CR.PM2 Position                     */
#define ETM_CR_PM2(x)                            (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< ETM_CR.PM2 Field                        */
#define ETM_CR_PM_MASK                           (0x30000U)                                          /*!< ETM_CR.PM Mask                          */
#define ETM_CR_PM_SHIFT                          (16U)                                               /*!< ETM_CR.PM Position                      */
#define ETM_CR_PM(x)                             (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< ETM_CR.PM Field                         */
#define ETM_CR_PS3_MASK                          (0x200000U)                                         /*!< ETM_CR.PS3 Mask                         */
#define ETM_CR_PS3_SHIFT                         (21U)                                               /*!< ETM_CR.PS3 Position                     */
#define ETM_CR_PS3(x)                            (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< ETM_CR.PS3 Field                        */
#define ETM_CR_TE_MASK                           (0x10000000U)                                       /*!< ETM_CR.TE Mask                          */
#define ETM_CR_TE_SHIFT                          (28U)                                               /*!< ETM_CR.TE Position                      */
#define ETM_CR_TE(x)                             (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< ETM_CR.TE Field                         */
/* ------- CCR Bit Fields                           ------ */
#define ETM_CCR_NumberOfAddressComparatorPairs_MASK (0xFU)                                           /*!< ETM_CCR.NumberOfAddressComparatorPairs Mask*/
#define ETM_CCR_NumberOfAddressComparatorPairs_SHIFT (0U)                                            /*!< ETM_CCR.NumberOfAddressComparatorPairs Position*/
#define ETM_CCR_NumberOfAddressComparatorPairs(x) (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)          /*!< ETM_CCR.NumberOfAddressComparatorPairs Field*/
#define ETM_CCR_NDVC_MASK                        (0xF0U)                                             /*!< ETM_CCR.NDVC Mask                       */
#define ETM_CCR_NDVC_SHIFT                       (4U)                                                /*!< ETM_CCR.NDVC Position                   */
#define ETM_CCR_NDVC(x)                          (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETM_CCR.NDVC Field                      */
#define ETM_CCR_NMMD_MASK                        (0x1F00U)                                           /*!< ETM_CCR.NMMD Mask                       */
#define ETM_CCR_NMMD_SHIFT                       (8U)                                                /*!< ETM_CCR.NMMD Position                   */
#define ETM_CCR_NMMD(x)                          (((uint32_t)(((uint32_t)(x))<<8U))&0x1F00UL)        /*!< ETM_CCR.NMMD Field                      */
#define ETM_CCR_NC_MASK                          (0xE000U)                                           /*!< ETM_CCR.NC Mask                         */
#define ETM_CCR_NC_SHIFT                         (13U)                                               /*!< ETM_CCR.NC Position                     */
#define ETM_CCR_NC(x)                            (((uint32_t)(((uint32_t)(x))<<13U))&0xE000UL)       /*!< ETM_CCR.NC Field                        */
#define ETM_CCR_SP_MASK                          (0x10000U)                                          /*!< ETM_CCR.SP Mask                         */
#define ETM_CCR_SP_SHIFT                         (16U)                                               /*!< ETM_CCR.SP Position                     */
#define ETM_CCR_SP(x)                            (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< ETM_CCR.SP Field                        */
#define ETM_CCR_NEI_MASK                         (0xE0000U)                                          /*!< ETM_CCR.NEI Mask                        */
#define ETM_CCR_NEI_SHIFT                        (17U)                                               /*!< ETM_CCR.NEI Position                    */
#define ETM_CCR_NEI(x)                           (((uint32_t)(((uint32_t)(x))<<17U))&0xE0000UL)      /*!< ETM_CCR.NEI Field                       */
#define ETM_CCR_NEO_MASK                         (0x700000U)                                         /*!< ETM_CCR.NEO Mask                        */
#define ETM_CCR_NEO_SHIFT                        (20U)                                               /*!< ETM_CCR.NEO Position                    */
#define ETM_CCR_NEO(x)                           (((uint32_t)(((uint32_t)(x))<<20U))&0x700000UL)     /*!< ETM_CCR.NEO Field                       */
#define ETM_CCR_FFLP_MASK                        (0x800000U)                                         /*!< ETM_CCR.FFLP Mask                       */
#define ETM_CCR_FFLP_SHIFT                       (23U)                                               /*!< ETM_CCR.FFLP Position                   */
#define ETM_CCR_FFLP(x)                          (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< ETM_CCR.FFLP Field                      */
#define ETM_CCR_NCIDC_MASK                       (0x3000000U)                                        /*!< ETM_CCR.NCIDC Mask                      */
#define ETM_CCR_NCIDC_SHIFT                      (24U)                                               /*!< ETM_CCR.NCIDC Position                  */
#define ETM_CCR_NCIDC(x)                         (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< ETM_CCR.NCIDC Field                     */
#define ETM_CCR_TSSBP_MASK                       (0x4000000U)                                        /*!< ETM_CCR.TSSBP Mask                      */
#define ETM_CCR_TSSBP_SHIFT                      (26U)                                               /*!< ETM_CCR.TSSBP Position                  */
#define ETM_CCR_TSSBP(x)                         (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< ETM_CCR.TSSBP Field                     */
#define ETM_CCR_CMA_MASK                         (0x8000000U)                                        /*!< ETM_CCR.CMA Mask                        */
#define ETM_CCR_CMA_SHIFT                        (27U)                                               /*!< ETM_CCR.CMA Position                    */
#define ETM_CCR_CMA(x)                           (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< ETM_CCR.CMA Field                       */
#define ETM_CCR_ETMIDRP_MASK                     (0x80000000U)                                       /*!< ETM_CCR.ETMIDRP Mask                    */
#define ETM_CCR_ETMIDRP_SHIFT                    (31U)                                               /*!< ETM_CCR.ETMIDRP Position                */
#define ETM_CCR_ETMIDRP(x)                       (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< ETM_CCR.ETMIDRP Field                   */
/* ------- TRIGGER Bit Fields                       ------ */
#define ETM_TRIGGER_TriggerEvent_MASK            (0x1FFFFU)                                          /*!< ETM_TRIGGER.TriggerEvent Mask           */
#define ETM_TRIGGER_TriggerEvent_SHIFT           (0U)                                                /*!< ETM_TRIGGER.TriggerEvent Position       */
#define ETM_TRIGGER_TriggerEvent(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0x1FFFFUL)       /*!< ETM_TRIGGER.TriggerEvent Field          */
/* ------- SR Bit Fields                            ------ */
#define ETM_SR_UOF_MASK                          (0x1U)                                              /*!< ETM_SR.UOF Mask                         */
#define ETM_SR_UOF_SHIFT                         (0U)                                                /*!< ETM_SR.UOF Position                     */
#define ETM_SR_UOF(x)                            (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETM_SR.UOF Field                        */
#define ETM_SR_Progbit_MASK                      (0x2U)                                              /*!< ETM_SR.Progbit Mask                     */
#define ETM_SR_Progbit_SHIFT                     (1U)                                                /*!< ETM_SR.Progbit Position                 */
#define ETM_SR_Progbit(x)                        (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< ETM_SR.Progbit Field                    */
#define ETM_SR_Status_MASK                       (0x4U)                                              /*!< ETM_SR.Status Mask                      */
#define ETM_SR_Status_SHIFT                      (2U)                                                /*!< ETM_SR.Status Position                  */
#define ETM_SR_Status(x)                         (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< ETM_SR.Status Field                     */
#define ETM_SR_Trigger_MASK                      (0x8U)                                              /*!< ETM_SR.Trigger Mask                     */
#define ETM_SR_Trigger_SHIFT                     (3U)                                                /*!< ETM_SR.Trigger Position                 */
#define ETM_SR_Trigger(x)                        (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< ETM_SR.Trigger Field                    */
/* ------- SCR Bit Fields                           ------ */
#define ETM_SCR_MaximumPortSize_MASK             (0x7U)                                              /*!< ETM_SCR.MaximumPortSize Mask            */
#define ETM_SCR_MaximumPortSize_SHIFT            (0U)                                                /*!< ETM_SCR.MaximumPortSize Position        */
#define ETM_SCR_MaximumPortSize(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< ETM_SCR.MaximumPortSize Field           */
#define ETM_SCR_FIFOFULLsupported_MASK           (0x100U)                                            /*!< ETM_SCR.FIFOFULLsupported Mask          */
#define ETM_SCR_FIFOFULLsupported_SHIFT          (8U)                                                /*!< ETM_SCR.FIFOFULLsupported Position      */
#define ETM_SCR_FIFOFULLsupported(x)             (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< ETM_SCR.FIFOFULLsupported Field         */
#define ETM_SCR_MaximumPortSize3_MASK            (0x200U)                                            /*!< ETM_SCR.MaximumPortSize3 Mask           */
#define ETM_SCR_MaximumPortSize3_SHIFT           (9U)                                                /*!< ETM_SCR.MaximumPortSize3 Position       */
#define ETM_SCR_MaximumPortSize3(x)              (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< ETM_SCR.MaximumPortSize3 Field          */
#define ETM_SCR_PortSizeSupported_MASK           (0x400U)                                            /*!< ETM_SCR.PortSizeSupported Mask          */
#define ETM_SCR_PortSizeSupported_SHIFT          (10U)                                               /*!< ETM_SCR.PortSizeSupported Position      */
#define ETM_SCR_PortSizeSupported(x)             (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< ETM_SCR.PortSizeSupported Field         */
#define ETM_SCR_PortModeSupported_MASK           (0x800U)                                            /*!< ETM_SCR.PortModeSupported Mask          */
#define ETM_SCR_PortModeSupported_SHIFT          (11U)                                               /*!< ETM_SCR.PortModeSupported Position      */
#define ETM_SCR_PortModeSupported(x)             (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< ETM_SCR.PortModeSupported Field         */
#define ETM_SCR_N_MASK                           (0x7000U)                                           /*!< ETM_SCR.N Mask                          */
#define ETM_SCR_N_SHIFT                          (12U)                                               /*!< ETM_SCR.N Position                      */
#define ETM_SCR_N(x)                             (((uint32_t)(((uint32_t)(x))<<12U))&0x7000UL)       /*!< ETM_SCR.N Field                         */
#define ETM_SCR_NoFetchComparisons_MASK          (0x20000U)                                          /*!< ETM_SCR.NoFetchComparisons Mask         */
#define ETM_SCR_NoFetchComparisons_SHIFT         (17U)                                               /*!< ETM_SCR.NoFetchComparisons Position     */
#define ETM_SCR_NoFetchComparisons(x)            (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< ETM_SCR.NoFetchComparisons Field        */
/* ------- EEVR Bit Fields                          ------ */
#define ETM_EEVR_TraceEnableEvent_MASK           (0x1FFFFU)                                          /*!< ETM_EEVR.TraceEnableEvent Mask          */
#define ETM_EEVR_TraceEnableEvent_SHIFT          (0U)                                                /*!< ETM_EEVR.TraceEnableEvent Position      */
#define ETM_EEVR_TraceEnableEvent(x)             (((uint32_t)(((uint32_t)(x))<<0U))&0x1FFFFUL)       /*!< ETM_EEVR.TraceEnableEvent Field         */
/* ------- TECR1 Bit Fields                         ------ */
#define ETM_TECR1_TraceControlEnable_MASK        (0x2000000U)                                        /*!< ETM_TECR1.TraceControlEnable Mask       */
#define ETM_TECR1_TraceControlEnable_SHIFT       (25U)                                               /*!< ETM_TECR1.TraceControlEnable Position   */
#define ETM_TECR1_TraceControlEnable(x)          (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< ETM_TECR1.TraceControlEnable Field      */
/* ------- FFLR Bit Fields                          ------ */
#define ETM_FFLR_FIFOFullLevel_MASK              (0xFFU)                                             /*!< ETM_FFLR.FIFOFullLevel Mask             */
#define ETM_FFLR_FIFOFullLevel_SHIFT             (0U)                                                /*!< ETM_FFLR.FIFOFullLevel Position         */
#define ETM_FFLR_FIFOFullLevel(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ETM_FFLR.FIFOFullLevel Field            */
/* ------- CNTRLDVR1 Bit Fields                     ------ */
#define ETM_CNTRLDVR1_IntitialCount_MASK         (0xFFFFU)                                           /*!< ETM_CNTRLDVR1.IntitialCount Mask        */
#define ETM_CNTRLDVR1_IntitialCount_SHIFT        (0U)                                                /*!< ETM_CNTRLDVR1.IntitialCount Position    */
#define ETM_CNTRLDVR1_IntitialCount(x)           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< ETM_CNTRLDVR1.IntitialCount Field       */
/* ------- SYNCFR Bit Fields                        ------ */
#define ETM_SYNCFR_SyncFrequency_MASK            (0xFFFU)                                            /*!< ETM_SYNCFR.SyncFrequency Mask           */
#define ETM_SYNCFR_SyncFrequency_SHIFT           (0U)                                                /*!< ETM_SYNCFR.SyncFrequency Position       */
#define ETM_SYNCFR_SyncFrequency(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFUL)         /*!< ETM_SYNCFR.SyncFrequency Field          */
/* ------- IDR Bit Fields                           ------ */
#define ETM_IDR_ImplementationRevision_MASK      (0xFU)                                              /*!< ETM_IDR.ImplementationRevision Mask     */
#define ETM_IDR_ImplementationRevision_SHIFT     (0U)                                                /*!< ETM_IDR.ImplementationRevision Position */
#define ETM_IDR_ImplementationRevision(x)        (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETM_IDR.ImplementationRevision Field    */
#define ETM_IDR_MinorETMarchitectureVersion_MASK (0xF0U)                                             /*!< ETM_IDR.MinorETMarchitectureVersion Mask*/
#define ETM_IDR_MinorETMarchitectureVersion_SHIFT (4U)                                               /*!< ETM_IDR.MinorETMarchitectureVersion Position*/
#define ETM_IDR_MinorETMarchitectureVersion(x)   (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETM_IDR.MinorETMarchitectureVersion Field*/
#define ETM_IDR_MajorETMarchitectureVersion_MASK (0xF00U)                                            /*!< ETM_IDR.MajorETMarchitectureVersion Mask*/
#define ETM_IDR_MajorETMarchitectureVersion_SHIFT (8U)                                               /*!< ETM_IDR.MajorETMarchitectureVersion Position*/
#define ETM_IDR_MajorETMarchitectureVersion(x)   (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< ETM_IDR.MajorETMarchitectureVersion Field*/
#define ETM_IDR_ProcessorFamily_MASK             (0xF000U)                                           /*!< ETM_IDR.ProcessorFamily Mask            */
#define ETM_IDR_ProcessorFamily_SHIFT            (12U)                                               /*!< ETM_IDR.ProcessorFamily Position        */
#define ETM_IDR_ProcessorFamily(x)               (((uint32_t)(((uint32_t)(x))<<12U))&0xF000UL)       /*!< ETM_IDR.ProcessorFamily Field           */
#define ETM_IDR_LoadPCfirst_MASK                 (0x10000U)                                          /*!< ETM_IDR.LoadPCfirst Mask                */
#define ETM_IDR_LoadPCfirst_SHIFT                (16U)                                               /*!< ETM_IDR.LoadPCfirst Position            */
#define ETM_IDR_LoadPCfirst(x)                   (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< ETM_IDR.LoadPCfirst Field               */
#define ETM_IDR_ThumbInstructionTracing_MASK     (0x40000U)                                          /*!< ETM_IDR.ThumbInstructionTracing Mask    */
#define ETM_IDR_ThumbInstructionTracing_SHIFT    (18U)                                               /*!< ETM_IDR.ThumbInstructionTracing Position*/
#define ETM_IDR_ThumbInstructionTracing(x)       (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< ETM_IDR.ThumbInstructionTracing Field   */
#define ETM_IDR_SecurityExtensionSupport_MASK    (0x80000U)                                          /*!< ETM_IDR.SecurityExtensionSupport Mask   */
#define ETM_IDR_SecurityExtensionSupport_SHIFT   (19U)                                               /*!< ETM_IDR.SecurityExtensionSupport Position*/
#define ETM_IDR_SecurityExtensionSupport(x)      (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< ETM_IDR.SecurityExtensionSupport Field  */
#define ETM_IDR_BranchPacketEncoding_MASK        (0x100000U)                                         /*!< ETM_IDR.BranchPacketEncoding Mask       */
#define ETM_IDR_BranchPacketEncoding_SHIFT       (20U)                                               /*!< ETM_IDR.BranchPacketEncoding Position   */
#define ETM_IDR_BranchPacketEncoding(x)          (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< ETM_IDR.BranchPacketEncoding Field      */
#define ETM_IDR_ImplementorCode_MASK             (0xFF000000U)                                       /*!< ETM_IDR.ImplementorCode Mask            */
#define ETM_IDR_ImplementorCode_SHIFT            (24U)                                               /*!< ETM_IDR.ImplementorCode Position        */
#define ETM_IDR_ImplementorCode(x)               (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< ETM_IDR.ImplementorCode Field           */
/* ------- CCER Bit Fields                          ------ */
#define ETM_CCER_ExtendedExternalInputSelectors_MASK (0x7U)                                          /*!< ETM_CCER.ExtendedExternalInputSelectors Mask*/
#define ETM_CCER_ExtendedExternalInputSelectors_SHIFT (0U)                                           /*!< ETM_CCER.ExtendedExternalInputSelectors Position*/
#define ETM_CCER_ExtendedExternalInputSelectors(x) (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)         /*!< ETM_CCER.ExtendedExternalInputSelectors Field*/
#define ETM_CCER_ExtendedExternalInputBus_MASK   (0x7F8U)                                            /*!< ETM_CCER.ExtendedExternalInputBus Mask  */
#define ETM_CCER_ExtendedExternalInputBus_SHIFT  (3U)                                                /*!< ETM_CCER.ExtendedExternalInputBus Position*/
#define ETM_CCER_ExtendedExternalInputBus(x)     (((uint32_t)(((uint32_t)(x))<<3U))&0x7F8UL)         /*!< ETM_CCER.ExtendedExternalInputBus Field */
#define ETM_CCER_ReadableRegisters_MASK          (0x800U)                                            /*!< ETM_CCER.ReadableRegisters Mask         */
#define ETM_CCER_ReadableRegisters_SHIFT         (11U)                                               /*!< ETM_CCER.ReadableRegisters Position     */
