podonoghue/T962a_Oven_Controller/Software/SMT_Oven_RTOS/Project_Headers/MK22DX256M5.h
#define ETM_CCER_ReadableRegisters(x)            (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< ETM_CCER.ReadableRegisters Field        */
#define ETM_CCER_DataAddressComparisons_MASK     (0x1000U)                                           /*!< ETM_CCER.DataAddressComparisons Mask    */
#define ETM_CCER_DataAddressComparisons_SHIFT    (12U)                                               /*!< ETM_CCER.DataAddressComparisons Position*/
#define ETM_CCER_DataAddressComparisons(x)       (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< ETM_CCER.DataAddressComparisons Field   */
#define ETM_CCER_InstrumentationResources_MASK   (0xE000U)                                           /*!< ETM_CCER.InstrumentationResources Mask  */
#define ETM_CCER_InstrumentationResources_SHIFT  (13U)                                               /*!< ETM_CCER.InstrumentationResources Position*/
#define ETM_CCER_InstrumentationResources(x)     (((uint32_t)(((uint32_t)(x))<<13U))&0xE000UL)       /*!< ETM_CCER.InstrumentationResources Field */
#define ETM_CCER_EmbeddedICEwatchpointInputs_MASK (0xF0000U)                                         /*!< ETM_CCER.EmbeddedICEwatchpointInputs Mask*/
#define ETM_CCER_EmbeddedICEwatchpointInputs_SHIFT (16U)                                             /*!< ETM_CCER.EmbeddedICEwatchpointInputs Position*/
#define ETM_CCER_EmbeddedICEwatchpointInputs(x)  (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< ETM_CCER.EmbeddedICEwatchpointInputs Field*/
#define ETM_CCER_TraceStartStopBlockUsesEmbeddedICEwatchpointInputs_MASK (0x100000U)                 /*!< ETM_CCER.TraceStartStopBlockUsesEmbeddedICEwatchpointInputs Mask*/
#define ETM_CCER_TraceStartStopBlockUsesEmbeddedICEwatchpointInputs_SHIFT (20U)                      /*!< ETM_CCER.TraceStartStopBlockUsesEmbeddedICEwatchpointInputs Position*/
#define ETM_CCER_TraceStartStopBlockUsesEmbeddedICEwatchpointInputs(x) (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL) /*!< ETM_CCER.TraceStartStopBlockUsesEmbeddedICEwatchpointInputs Field*/
#define ETM_CCER_EmbeddedICEbehaviorControlImplemented_MASK (0x200000U)                              /*!< ETM_CCER.EmbeddedICEbehaviorControlImplemented Mask*/
#define ETM_CCER_EmbeddedICEbehaviorControlImplemented_SHIFT (21U)                                   /*!< ETM_CCER.EmbeddedICEbehaviorControlImplemented Position*/
#define ETM_CCER_EmbeddedICEbehaviorControlImplemented(x) (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL) /*!< ETM_CCER.EmbeddedICEbehaviorControlImplemented Field*/
#define ETM_CCER_TimestampingImplemented_MASK    (0x400000U)                                         /*!< ETM_CCER.TimestampingImplemented Mask   */
#define ETM_CCER_TimestampingImplemented_SHIFT   (22U)                                               /*!< ETM_CCER.TimestampingImplemented Position*/
#define ETM_CCER_TimestampingImplemented(x)      (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< ETM_CCER.TimestampingImplemented Field  */
#define ETM_CCER_ReducedFunctionCounter_MASK     (0x8000000U)                                        /*!< ETM_CCER.ReducedFunctionCounter Mask    */
#define ETM_CCER_ReducedFunctionCounter_SHIFT    (27U)                                               /*!< ETM_CCER.ReducedFunctionCounter Position*/
#define ETM_CCER_ReducedFunctionCounter(x)       (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< ETM_CCER.ReducedFunctionCounter Field   */
#define ETM_CCER_TimestampEncoding_MASK          (0x10000000U)                                       /*!< ETM_CCER.TimestampEncoding Mask         */
#define ETM_CCER_TimestampEncoding_SHIFT         (28U)                                               /*!< ETM_CCER.TimestampEncoding Position     */
#define ETM_CCER_TimestampEncoding(x)            (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< ETM_CCER.TimestampEncoding Field        */
#define ETM_CCER_TimestampSize_MASK              (0x20000000U)                                       /*!< ETM_CCER.TimestampSize Mask             */
#define ETM_CCER_TimestampSize_SHIFT             (29U)                                               /*!< ETM_CCER.TimestampSize Position         */
#define ETM_CCER_TimestampSize(x)                (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< ETM_CCER.TimestampSize Field            */
/* ------- TESSEICR Bit Fields                      ------ */
#define ETM_TESSEICR_StartResourceSelection_MASK (0xFU)                                              /*!< ETM_TESSEICR.StartResourceSelection Mask*/
#define ETM_TESSEICR_StartResourceSelection_SHIFT (0U)                                               /*!< ETM_TESSEICR.StartResourceSelection Position*/
#define ETM_TESSEICR_StartResourceSelection(x)   (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETM_TESSEICR.StartResourceSelection Field*/
#define ETM_TESSEICR_StopResourceSelection_MASK  (0xF0000U)                                          /*!< ETM_TESSEICR.StopResourceSelection Mask */
#define ETM_TESSEICR_StopResourceSelection_SHIFT (16U)                                               /*!< ETM_TESSEICR.StopResourceSelection Position*/
#define ETM_TESSEICR_StopResourceSelection(x)    (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< ETM_TESSEICR.StopResourceSelection Field*/
/* ------- TSEVR Bit Fields                         ------ */
#define ETM_TSEVR_TimestampEvent_MASK            (0xFFFU)                                            /*!< ETM_TSEVR.TimestampEvent Mask           */
#define ETM_TSEVR_TimestampEvent_SHIFT           (0U)                                                /*!< ETM_TSEVR.TimestampEvent Position       */
#define ETM_TSEVR_TimestampEvent(x)              (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFUL)         /*!< ETM_TSEVR.TimestampEvent Field          */
/* ------- TRACEIDR Bit Fields                      ------ */
#define ETM_TRACEIDR_TraceID_MASK                (0x7FU)                                             /*!< ETM_TRACEIDR.TraceID Mask               */
#define ETM_TRACEIDR_TraceID_SHIFT               (0U)                                                /*!< ETM_TRACEIDR.TraceID Position           */
#define ETM_TRACEIDR_TraceID(x)                  (((uint32_t)(((uint32_t)(x))<<0U))&0x7FUL)          /*!< ETM_TRACEIDR.TraceID Field              */
/* ------- IDR2 Bit Fields                          ------ */
/* ------- PDSR Bit Fields                          ------ */
#define ETM_PDSR_ETMpoweredup_MASK               (0x1U)                                              /*!< ETM_PDSR.ETMpoweredup Mask              */
#define ETM_PDSR_ETMpoweredup_SHIFT              (0U)                                                /*!< ETM_PDSR.ETMpoweredup Position          */
#define ETM_PDSR_ETMpoweredup(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETM_PDSR.ETMpoweredup Field             */
/* ------- _ITMISCIN Bit Fields                     ------ */
#define ETM__ITMISCIN_EXTIN_MASK                 (0x3U)                                              /*!< ETM__ITMISCIN.EXTIN Mask                */
#define ETM__ITMISCIN_EXTIN_SHIFT                (0U)                                                /*!< ETM__ITMISCIN.EXTIN Position            */
#define ETM__ITMISCIN_EXTIN(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< ETM__ITMISCIN.EXTIN Field               */
#define ETM__ITMISCIN_COREHALT_MASK              (0x10U)                                             /*!< ETM__ITMISCIN.COREHALT Mask             */
#define ETM__ITMISCIN_COREHALT_SHIFT             (4U)                                                /*!< ETM__ITMISCIN.COREHALT Position         */
#define ETM__ITMISCIN_COREHALT(x)                (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< ETM__ITMISCIN.COREHALT Field            */
/* ------- _ITTRIGOUT Bit Fields                    ------ */
#define ETM__ITTRIGOUT_TRIGGER_MASK              (0x1U)                                              /*!< ETM__ITTRIGOUT.TRIGGER Mask             */
#define ETM__ITTRIGOUT_TRIGGER_SHIFT             (0U)                                                /*!< ETM__ITTRIGOUT.TRIGGER Position         */
#define ETM__ITTRIGOUT_TRIGGER(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETM__ITTRIGOUT.TRIGGER Field            */
/* ------- _ITATBCTR2 Bit Fields                    ------ */
#define ETM__ITATBCTR2_ATREADY_MASK              (0x1U)                                              /*!< ETM__ITATBCTR2.ATREADY Mask             */
#define ETM__ITATBCTR2_ATREADY_SHIFT             (0U)                                                /*!< ETM__ITATBCTR2.ATREADY Position         */
#define ETM__ITATBCTR2_ATREADY(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETM__ITATBCTR2.ATREADY Field            */
/* ------- _ITATBCTR0 Bit Fields                    ------ */
#define ETM__ITATBCTR0_ATVALID_MASK              (0x1U)                                              /*!< ETM__ITATBCTR0.ATVALID Mask             */
#define ETM__ITATBCTR0_ATVALID_SHIFT             (0U)                                                /*!< ETM__ITATBCTR0.ATVALID Position         */
#define ETM__ITATBCTR0_ATVALID(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETM__ITATBCTR0.ATVALID Field            */
/* ------- ITCTRL Bit Fields                        ------ */
#define ETM_ITCTRL_Mode_MASK                     (0x1U)                                              /*!< ETM_ITCTRL.Mode Mask                    */
#define ETM_ITCTRL_Mode_SHIFT                    (0U)                                                /*!< ETM_ITCTRL.Mode Position                */
#define ETM_ITCTRL_Mode(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETM_ITCTRL.Mode Field                   */
/* ------- CLAIMSET Bit Fields                      ------ */
#define ETM_CLAIMSET_CLAIMSET_MASK               (0xFU)                                              /*!< ETM_CLAIMSET.CLAIMSET Mask              */
#define ETM_CLAIMSET_CLAIMSET_SHIFT              (0U)                                                /*!< ETM_CLAIMSET.CLAIMSET Position          */
#define ETM_CLAIMSET_CLAIMSET(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETM_CLAIMSET.CLAIMSET Field             */
/* ------- CLAIMCLR Bit Fields                      ------ */
#define ETM_CLAIMCLR_CLAIMCLR_MASK               (0xFU)                                              /*!< ETM_CLAIMCLR.CLAIMCLR Mask              */
#define ETM_CLAIMCLR_CLAIMCLR_SHIFT              (0U)                                                /*!< ETM_CLAIMCLR.CLAIMCLR Position          */
#define ETM_CLAIMCLR_CLAIMCLR(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETM_CLAIMCLR.CLAIMCLR Field             */
/* ------- LAR Bit Fields                           ------ */
#define ETM_LAR_WriteAccessCode_MASK             (0xFFFFFFFFU)                                       /*!< ETM_LAR.WriteAccessCode Mask            */
#define ETM_LAR_WriteAccessCode_SHIFT            (0U)                                                /*!< ETM_LAR.WriteAccessCode Position        */
#define ETM_LAR_WriteAccessCode(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ETM_LAR.WriteAccessCode Field           */
/* ------- LSR Bit Fields                           ------ */
#define ETM_LSR_IMP_MASK                         (0x1U)                                              /*!< ETM_LSR.IMP Mask                        */
#define ETM_LSR_IMP_SHIFT                        (0U)                                                /*!< ETM_LSR.IMP Position                    */
#define ETM_LSR_IMP(x)                           (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETM_LSR.IMP Field                       */
#define ETM_LSR_STATUS_MASK                      (0x2U)                                              /*!< ETM_LSR.STATUS Mask                     */
#define ETM_LSR_STATUS_SHIFT                     (1U)                                                /*!< ETM_LSR.STATUS Position                 */
#define ETM_LSR_STATUS(x)                        (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< ETM_LSR.STATUS Field                    */
#define ETM_LSR_s8BIT_MASK                       (0x4U)                                              /*!< ETM_LSR.s8BIT Mask                      */
#define ETM_LSR_s8BIT_SHIFT                      (2U)                                                /*!< ETM_LSR.s8BIT Position                  */
#define ETM_LSR_s8BIT(x)                         (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< ETM_LSR.s8BIT Field                     */
/* ------- AUTHSTATUS Bit Fields                    ------ */
#define ETM_AUTHSTATUS_NSID_MASK                 (0x3U)                                              /*!< ETM_AUTHSTATUS.NSID Mask                */
#define ETM_AUTHSTATUS_NSID_SHIFT                (0U)                                                /*!< ETM_AUTHSTATUS.NSID Position            */
#define ETM_AUTHSTATUS_NSID(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< ETM_AUTHSTATUS.NSID Field               */
#define ETM_AUTHSTATUS_NSNID_MASK                (0xCU)                                              /*!< ETM_AUTHSTATUS.NSNID Mask               */
#define ETM_AUTHSTATUS_NSNID_SHIFT               (2U)                                                /*!< ETM_AUTHSTATUS.NSNID Position           */
#define ETM_AUTHSTATUS_NSNID(x)                  (((uint32_t)(((uint32_t)(x))<<2U))&0xCUL)           /*!< ETM_AUTHSTATUS.NSNID Field              */
#define ETM_AUTHSTATUS_SID_MASK                  (0x30U)                                             /*!< ETM_AUTHSTATUS.SID Mask                 */
#define ETM_AUTHSTATUS_SID_SHIFT                 (4U)                                                /*!< ETM_AUTHSTATUS.SID Position             */
#define ETM_AUTHSTATUS_SID(x)                    (((uint32_t)(((uint32_t)(x))<<4U))&0x30UL)          /*!< ETM_AUTHSTATUS.SID Field                */
#define ETM_AUTHSTATUS_SNID_MASK                 (0xC0U)                                             /*!< ETM_AUTHSTATUS.SNID Mask                */
#define ETM_AUTHSTATUS_SNID_SHIFT                (6U)                                                /*!< ETM_AUTHSTATUS.SNID Position            */
#define ETM_AUTHSTATUS_SNID(x)                   (((uint32_t)(((uint32_t)(x))<<6U))&0xC0UL)          /*!< ETM_AUTHSTATUS.SNID Field               */
/* ------- DEVTYPE Bit Fields                       ------ */
#define ETM_DEVTYPE_MajorType_MASK               (0xFU)                                              /*!< ETM_DEVTYPE.MajorType Mask              */
#define ETM_DEVTYPE_MajorType_SHIFT              (0U)                                                /*!< ETM_DEVTYPE.MajorType Position          */
#define ETM_DEVTYPE_MajorType(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETM_DEVTYPE.MajorType Field             */
#define ETM_DEVTYPE_SubType_MASK                 (0xF0U)                                             /*!< ETM_DEVTYPE.SubType Mask                */
#define ETM_DEVTYPE_SubType_SHIFT                (4U)                                                /*!< ETM_DEVTYPE.SubType Position            */
#define ETM_DEVTYPE_SubType(x)                   (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETM_DEVTYPE.SubType Field               */
/* ------- PIDR4 Bit Fields                         ------ */
#define ETM_PIDR4_JEP106_MASK                    (0xFU)                                              /*!< ETM_PIDR4.JEP106 Mask                   */
#define ETM_PIDR4_JEP106_SHIFT                   (0U)                                                /*!< ETM_PIDR4.JEP106 Position               */
#define ETM_PIDR4_JEP106(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETM_PIDR4.JEP106 Field                  */
#define ETM_PIDR4_c4KB_MASK                      (0xF0U)                                             /*!< ETM_PIDR4.c4KB Mask                     */
#define ETM_PIDR4_c4KB_SHIFT                     (4U)                                                /*!< ETM_PIDR4.c4KB Position                 */
#define ETM_PIDR4_c4KB(x)                        (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETM_PIDR4.c4KB Field                    */
/* ------- PIDR5 Bit Fields                         ------ */
/* ------- PIDR6 Bit Fields                         ------ */
/* ------- PIDR7 Bit Fields                         ------ */
/* ------- PIDR0 Bit Fields                         ------ */
#define ETM_PIDR0_PartNumber_MASK                (0xFFU)                                             /*!< ETM_PIDR0.PartNumber Mask               */
#define ETM_PIDR0_PartNumber_SHIFT               (0U)                                                /*!< ETM_PIDR0.PartNumber Position           */
#define ETM_PIDR0_PartNumber(x)                  (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ETM_PIDR0.PartNumber Field              */
/* ------- PIDR1 Bit Fields                         ------ */
#define ETM_PIDR1_PartNumber_MASK                (0xFU)                                              /*!< ETM_PIDR1.PartNumber Mask               */
#define ETM_PIDR1_PartNumber_SHIFT               (0U)                                                /*!< ETM_PIDR1.PartNumber Position           */
#define ETM_PIDR1_PartNumber(x)                  (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETM_PIDR1.PartNumber Field              */
#define ETM_PIDR1_JEP106_identity_code_MASK      (0xF0U)                                             /*!< ETM_PIDR1.JEP106_identity_code Mask     */
#define ETM_PIDR1_JEP106_identity_code_SHIFT     (4U)                                                /*!< ETM_PIDR1.JEP106_identity_code Position */
#define ETM_PIDR1_JEP106_identity_code(x)        (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETM_PIDR1.JEP106_identity_code Field    */
/* ------- PIDR2 Bit Fields                         ------ */
#define ETM_PIDR2_JEP106_identity_code_MASK      (0x7U)                                              /*!< ETM_PIDR2.JEP106_identity_code Mask     */
#define ETM_PIDR2_JEP106_identity_code_SHIFT     (0U)                                                /*!< ETM_PIDR2.JEP106_identity_code Position */
#define ETM_PIDR2_JEP106_identity_code(x)        (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< ETM_PIDR2.JEP106_identity_code Field    */
#define ETM_PIDR2_Revision_MASK                  (0xF0U)                                             /*!< ETM_PIDR2.Revision Mask                 */
#define ETM_PIDR2_Revision_SHIFT                 (4U)                                                /*!< ETM_PIDR2.Revision Position             */
#define ETM_PIDR2_Revision(x)                    (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETM_PIDR2.Revision Field                */
/* ------- PIDR3 Bit Fields                         ------ */
#define ETM_PIDR3_CustomerModified_MASK          (0xFU)                                              /*!< ETM_PIDR3.CustomerModified Mask         */
#define ETM_PIDR3_CustomerModified_SHIFT         (0U)                                                /*!< ETM_PIDR3.CustomerModified Position     */
#define ETM_PIDR3_CustomerModified(x)            (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETM_PIDR3.CustomerModified Field        */
#define ETM_PIDR3_RevAnd_MASK                    (0xF0U)                                             /*!< ETM_PIDR3.RevAnd Mask                   */
#define ETM_PIDR3_RevAnd_SHIFT                   (4U)                                                /*!< ETM_PIDR3.RevAnd Position               */
#define ETM_PIDR3_RevAnd(x)                      (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETM_PIDR3.RevAnd Field                  */
/* ------- CIDR0 Bit Fields                         ------ */
#define ETM_CIDR0_Preamble_MASK                  (0xFFU)                                             /*!< ETM_CIDR0.Preamble Mask                 */
#define ETM_CIDR0_Preamble_SHIFT                 (0U)                                                /*!< ETM_CIDR0.Preamble Position             */
#define ETM_CIDR0_Preamble(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ETM_CIDR0.Preamble Field                */
/* ------- CIDR1 Bit Fields                         ------ */
#define ETM_CIDR1_Preamble_MASK                  (0xFU)                                              /*!< ETM_CIDR1.Preamble Mask                 */
#define ETM_CIDR1_Preamble_SHIFT                 (0U)                                                /*!< ETM_CIDR1.Preamble Position             */
#define ETM_CIDR1_Preamble(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETM_CIDR1.Preamble Field                */
#define ETM_CIDR1_ComponentClass_MASK            (0xF0U)                                             /*!< ETM_CIDR1.ComponentClass Mask           */
#define ETM_CIDR1_ComponentClass_SHIFT           (4U)                                                /*!< ETM_CIDR1.ComponentClass Position       */
#define ETM_CIDR1_ComponentClass(x)              (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETM_CIDR1.ComponentClass Field          */
/* ------- CIDR2 Bit Fields                         ------ */
#define ETM_CIDR2_Preamble_MASK                  (0xFFU)                                             /*!< ETM_CIDR2.Preamble Mask                 */
#define ETM_CIDR2_Preamble_SHIFT                 (0U)                                                /*!< ETM_CIDR2.Preamble Position             */
#define ETM_CIDR2_Preamble(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ETM_CIDR2.Preamble Field                */
/* ------- CIDR3 Bit Fields                         ------ */
#define ETM_CIDR3_Preamble_MASK                  (0xFFU)                                             /*!< ETM_CIDR3.Preamble Mask                 */
#define ETM_CIDR3_Preamble_SHIFT                 (0U)                                                /*!< ETM_CIDR3.Preamble Position             */
#define ETM_CIDR3_Preamble(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ETM_CIDR3.Preamble Field                */
/**
 * @} */ /* End group ETM_Register_Masks_GROUP 
 */

