podonoghue/T962a_Oven_Controller/Software/SMT_Oven_RTOS/Project_Headers/MK22DX256M5.h
/**
* @addtogroup FPB_Register_Masks_GROUP FPB Register Masks
* @brief Register Masks for FPB
* @{
*/
/* ------- CTRL Bit Fields                          ------ */
#define FPB_CTRL_ENABLE_MASK                     (0x1U)                                              /*!< FPB_CTRL.ENABLE Mask                    */
#define FPB_CTRL_ENABLE_SHIFT                    (0U)                                                /*!< FPB_CTRL.ENABLE Position                */
#define FPB_CTRL_ENABLE(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FPB_CTRL.ENABLE Field                   */
#define FPB_CTRL_KEY_MASK                        (0x2U)                                              /*!< FPB_CTRL.KEY Mask                       */
#define FPB_CTRL_KEY_SHIFT                       (1U)                                                /*!< FPB_CTRL.KEY Position                   */
#define FPB_CTRL_KEY(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< FPB_CTRL.KEY Field                      */
#define FPB_CTRL_NUM_CODE_least_MASK             (0xF0U)                                             /*!< FPB_CTRL.NUM_CODE_least Mask            */
#define FPB_CTRL_NUM_CODE_least_SHIFT            (4U)                                                /*!< FPB_CTRL.NUM_CODE_least Position        */
#define FPB_CTRL_NUM_CODE_least(x)               (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< FPB_CTRL.NUM_CODE_least Field           */
#define FPB_CTRL_NUM_LIT_MASK                    (0xF00U)                                            /*!< FPB_CTRL.NUM_LIT Mask                   */
#define FPB_CTRL_NUM_LIT_SHIFT                   (8U)                                                /*!< FPB_CTRL.NUM_LIT Position               */
#define FPB_CTRL_NUM_LIT(x)                      (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< FPB_CTRL.NUM_LIT Field                  */
#define FPB_CTRL_NUM_CODE_most_MASK              (0x7000U)                                           /*!< FPB_CTRL.NUM_CODE_most Mask             */
#define FPB_CTRL_NUM_CODE_most_SHIFT             (12U)                                               /*!< FPB_CTRL.NUM_CODE_most Position         */
#define FPB_CTRL_NUM_CODE_most(x)                (((uint32_t)(((uint32_t)(x))<<12U))&0x7000UL)       /*!< FPB_CTRL.NUM_CODE_most Field            */
/* ------- REMAP Bit Fields                         ------ */
#define FPB_REMAP_REMAP_MASK                     (0x1FFFFFE0U)                                       /*!< FPB_REMAP.REMAP Mask                    */
#define FPB_REMAP_REMAP_SHIFT                    (5U)                                                /*!< FPB_REMAP.REMAP Position                */
#define FPB_REMAP_REMAP(x)                       (((uint32_t)(((uint32_t)(x))<<5U))&0x1FFFFFE0UL)    /*!< FPB_REMAP.REMAP Field                   */
#define FPB_REMAP_RMPSPT_MASK                    (0x20000000U)                                       /*!< FPB_REMAP.RMPSPT Mask                   */
#define FPB_REMAP_RMPSPT_SHIFT                   (29U)                                               /*!< FPB_REMAP.RMPSPT Position               */
#define FPB_REMAP_RMPSPT(x)                      (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< FPB_REMAP.RMPSPT Field                  */
/* ------- COMP Bit Fields                          ------ */
#define FPB_COMP_ENABLE_MASK                     (0x1U)                                              /*!< FPB_COMP.ENABLE Mask                    */
#define FPB_COMP_ENABLE_SHIFT                    (0U)                                                /*!< FPB_COMP.ENABLE Position                */
#define FPB_COMP_ENABLE(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FPB_COMP.ENABLE Field                   */
#define FPB_COMP_COMP_MASK                       (0x1FFFFFFCU)                                       /*!< FPB_COMP.COMP Mask                      */
#define FPB_COMP_COMP_SHIFT                      (2U)                                                /*!< FPB_COMP.COMP Position                  */
#define FPB_COMP_COMP(x)                         (((uint32_t)(((uint32_t)(x))<<2U))&0x1FFFFFFCUL)    /*!< FPB_COMP.COMP Field                     */
#define FPB_COMP_REPLACE_MASK                    (0xC0000000U)                                       /*!< FPB_COMP.REPLACE Mask                   */
#define FPB_COMP_REPLACE_SHIFT                   (30U)                                               /*!< FPB_COMP.REPLACE Position               */
#define FPB_COMP_REPLACE(x)                      (((uint32_t)(((uint32_t)(x))<<30U))&0xC0000000UL)   /*!< FPB_COMP.REPLACE Field                  */
/* ------- PID4 Bit Fields                          ------ */
#define FPB_PID4_JEP106_MASK                     (0xFU)                                              /*!< FPB_PID4.JEP106 Mask                    */
#define FPB_PID4_JEP106_SHIFT                    (0U)                                                /*!< FPB_PID4.JEP106 Position                */
#define FPB_PID4_JEP106(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< FPB_PID4.JEP106 Field                   */
#define FPB_PID4_c4KB_MASK                       (0xF0U)                                             /*!< FPB_PID4.c4KB Mask                      */
#define FPB_PID4_c4KB_SHIFT                      (4U)                                                /*!< FPB_PID4.c4KB Position                  */
#define FPB_PID4_c4KB(x)                         (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< FPB_PID4.c4KB Field                     */
/* ------- PID5 Bit Fields                          ------ */
/* ------- PID6 Bit Fields                          ------ */
/* ------- PID7 Bit Fields                          ------ */
/* ------- PID0 Bit Fields                          ------ */
#define FPB_PID0_PartNumber_MASK                 (0xFFU)                                             /*!< FPB_PID0.PartNumber Mask                */
#define FPB_PID0_PartNumber_SHIFT                (0U)                                                /*!< FPB_PID0.PartNumber Position            */
#define FPB_PID0_PartNumber(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< FPB_PID0.PartNumber Field               */
/* ------- PID1 Bit Fields                          ------ */
#define FPB_PID1_PartNumber_MASK                 (0xFU)                                              /*!< FPB_PID1.PartNumber Mask                */
#define FPB_PID1_PartNumber_SHIFT                (0U)                                                /*!< FPB_PID1.PartNumber Position            */
#define FPB_PID1_PartNumber(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< FPB_PID1.PartNumber Field               */
#define FPB_PID1_JEP106_identity_code_MASK       (0xF0U)                                             /*!< FPB_PID1.JEP106_identity_code Mask      */
#define FPB_PID1_JEP106_identity_code_SHIFT      (4U)                                                /*!< FPB_PID1.JEP106_identity_code Position  */
#define FPB_PID1_JEP106_identity_code(x)         (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< FPB_PID1.JEP106_identity_code Field     */
/* ------- PID2 Bit Fields                          ------ */
#define FPB_PID2_JEP106_identity_code_MASK       (0x7U)                                              /*!< FPB_PID2.JEP106_identity_code Mask      */
#define FPB_PID2_JEP106_identity_code_SHIFT      (0U)                                                /*!< FPB_PID2.JEP106_identity_code Position  */
#define FPB_PID2_JEP106_identity_code(x)         (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< FPB_PID2.JEP106_identity_code Field     */
#define FPB_PID2_Revision_MASK                   (0xF0U)                                             /*!< FPB_PID2.Revision Mask                  */
#define FPB_PID2_Revision_SHIFT                  (4U)                                                /*!< FPB_PID2.Revision Position              */
#define FPB_PID2_Revision(x)                     (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< FPB_PID2.Revision Field                 */
/* ------- PID3 Bit Fields                          ------ */
#define FPB_PID3_CustomerModified_MASK           (0xFU)                                              /*!< FPB_PID3.CustomerModified Mask          */
#define FPB_PID3_CustomerModified_SHIFT          (0U)                                                /*!< FPB_PID3.CustomerModified Position      */
#define FPB_PID3_CustomerModified(x)             (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< FPB_PID3.CustomerModified Field         */
#define FPB_PID3_RevAnd_MASK                     (0xF0U)                                             /*!< FPB_PID3.RevAnd Mask                    */
#define FPB_PID3_RevAnd_SHIFT                    (4U)                                                /*!< FPB_PID3.RevAnd Position                */
#define FPB_PID3_RevAnd(x)                       (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< FPB_PID3.RevAnd Field                   */
/* ------- CID0 Bit Fields                          ------ */
#define FPB_CID0_Preamble_MASK                   (0xFFU)                                             /*!< FPB_CID0.Preamble Mask                  */
#define FPB_CID0_Preamble_SHIFT                  (0U)                                                /*!< FPB_CID0.Preamble Position              */
#define FPB_CID0_Preamble(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< FPB_CID0.Preamble Field                 */
/* ------- CID1 Bit Fields                          ------ */
#define FPB_CID1_Preamble_MASK                   (0xFU)                                              /*!< FPB_CID1.Preamble Mask                  */
#define FPB_CID1_Preamble_SHIFT                  (0U)                                                /*!< FPB_CID1.Preamble Position              */
#define FPB_CID1_Preamble(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< FPB_CID1.Preamble Field                 */
#define FPB_CID1_ComponentClass_MASK             (0xF0U)                                             /*!< FPB_CID1.ComponentClass Mask            */
#define FPB_CID1_ComponentClass_SHIFT            (4U)                                                /*!< FPB_CID1.ComponentClass Position        */
#define FPB_CID1_ComponentClass(x)               (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< FPB_CID1.ComponentClass Field           */
/* ------- CID2 Bit Fields                          ------ */
#define FPB_CID2_Preamble_MASK                   (0xFFU)                                             /*!< FPB_CID2.Preamble Mask                  */
#define FPB_CID2_Preamble_SHIFT                  (0U)                                                /*!< FPB_CID2.Preamble Position              */
#define FPB_CID2_Preamble(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< FPB_CID2.Preamble Field                 */
/* ------- CID3 Bit Fields                          ------ */
#define FPB_CID3_Preamble_MASK                   (0xFFU)                                             /*!< FPB_CID3.Preamble Mask                  */
#define FPB_CID3_Preamble_SHIFT                  (0U)                                                /*!< FPB_CID3.Preamble Position              */
#define FPB_CID3_Preamble(x)                     (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< FPB_CID3.Preamble Field                 */
/**
 * @} */ /* End group FPB_Register_Masks_GROUP 
 */

/* FPB - Peripheral instance base addresses */
#define FPB_BasePtr                    0xE0002000UL //!< Peripheral base address
#define FPB                            ((FPB_Type *) FPB_BasePtr) //!< Freescale base pointer
#define FPB_BASE_PTR                   (FPB) //!< Freescale style base pointer
/**
 * @} */ /* End group FPB_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FTFL_Peripheral_access_layer_GROUP FTFL Peripheral Access Layer
* @brief C Struct for FTFL
* @{
*/

/* ================================================================================ */
/* ================           FTFL (file:FTFL)                     ================ */
/* ================================================================================ */

/**
 * @brief Flash Memory Interface
 */
/**
* @addtogroup FTFL_structs_GROUP FTFL struct
* @brief Struct for FTFL
* @{
*/
typedef struct FTFL_Type {
   __IO uint8_t   FSTAT;                        /**< 0000: Flash Status Register                                        */
   __IO uint8_t   FCNFG;                        /**< 0001: Flash Configuration Register                                 */
   __I  uint8_t   FSEC;                         /**< 0002: Flash Security Register                                      */
   __I  uint8_t   FOPT;                         /**< 0003: Flash Option Register                                        */
   __IO uint8_t   FCCOB3;                       /**< 0004: FCCOB 3 - Usually Flash address [7..0]                       */
   __IO uint8_t   FCCOB2;                       /**< 0005: FCCOB 2 - Usually Flash address [15..8]                      */
   __IO uint8_t   FCCOB1;                       /**< 0006: FCCOB 1 - Usually Flash address [23..16]                     */
   __IO uint8_t   FCCOB0;                       /**< 0007: FCCOB 0 - Usually FCMD (Flash command)                       */
   __IO uint8_t   FCCOB7;                       /**< 0008: FCCOB 7 - Usually Data Byte 3                                */
   __IO uint8_t   FCCOB6;                       /**< 0009: FCCOB 6 - Usually Data Byte 2                                */
   __IO uint8_t   FCCOB5;                       /**< 000A: FCCOB 5 - Usually Data Byte 1                                */
   __IO uint8_t   FCCOB4;                       /**< 000B: FCCOB 4 - Usually Data Byte 0                                */
   __IO uint8_t   FCCOBB;                       /**< 000C: FCCOB B - Usually Data Byte 7                                */
   __IO uint8_t   FCCOBA;                       /**< 000D: FCCOB A - Usually Data Byte 6                                */
   __IO uint8_t   FCCOB9;                       /**< 000E: FCCOB 9 - Usually Data Byte 5                                */
   __IO uint8_t   FCCOB8;                       /**< 000F: FCCOB 8 - Usually Data Byte 4                                */
   __IO uint8_t   FPROT3;                       /**< 0010: Program Flash Protection                                     */
   __IO uint8_t   FPROT2;                       /**< 0011: Program Flash Protection                                     */
   __IO uint8_t   FPROT1;                       /**< 0012: Program Flash Protection                                     */
   __IO uint8_t   FPROT0;                       /**< 0013: Program Flash Protection                                     */
        uint8_t   RESERVED_0[2];               
   __IO uint8_t   FEPROT;                       /**< 0016: EEPROM Protection Register                                   */
   __IO uint8_t   FDPROT;                       /**< 0017: Data Flash Protection Register                               */
} FTFL_Type;

/**
 * @} */ /* End group FTFL_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FTFL' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

